3s1d/fanet-stm32/Src/fanet/radio/sx1272.c
#include <stdlib.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>

#include "main.h"
#include "stm32l4xx.h"
#include "stm32l4xx_hal_gpio.h"
#include "stm32l4xx_hal_spi.h"

#include "minmax.h"

#include "sx1272.h"

#ifdef SX1272_DO_FSK
#include <math.h>
#endif


bool sx1272_armed = false;
irq_callback sx1272_irq_cb = NULL;
SPI_HandleTypeDef *sx1272_spi = NULL;
float sx_dutycycle = 0.0f;
float sx_airtime = 0.0f;
sx_region_t sx1272_region = {.channel = 0, .dBm = 0, .bw = 0};
static bool sx_payloadCrc = false;

#ifdef SX1272_DO_FSK
#define SX_REG_BACKUP_POR			0
#define SX_REG_BACKUP_LORA			1
#define SX_REG_BACKUP_OFFSET		REG_BITRATE_MSB
uint8_t sx_reg_backup[2][111];
#endif

/*
 * private
 */

//note: disabling interrupt not required as fanet task will only  operate on this and an INT only generates a signal -> handled ion sync

static inline void sx_select()
{
	HAL_NVIC_DisableIRQ(SXDIO0_EXTI8_EXTI_IRQn);
	HAL_GPIO_WritePin(SXSEL_GPIO_Port, SXSEL_Pin, GPIO_PIN_RESET);
}

static inline void sx_unselect()
{
	HAL_GPIO_WritePin(SXSEL_GPIO_Port, SXSEL_Pin, GPIO_PIN_SET);
	HAL_NVIC_EnableIRQ(SXDIO0_EXTI8_EXTI_IRQn);
}

uint8_t sx_readRegister(uint8_t address)
{
	if(sx1272_spi == NULL)
		return 0;

	sx_select();

	/* bit 7 cleared to read in registers */
	address &= 0x7F;

	HAL_SPI_Transmit(sx1272_spi, &address, 1, 200);
	uint8_t value;
	HAL_SPI_Receive(sx1272_spi, &value, 1, 200);
	sx_unselect();

	return value;
}

void sx_writeRegister(uint8_t address, uint8_t data)
{
	sx_select();
	/* bit 7 set to write registers */
	address |= 0x80;

	uint8_t tx[2] = {address, data};
	HAL_SPI_Transmit(sx1272_spi, tx, 2, 200);
	sx_unselect();

#ifdef SX1272_DO_FSK
	/* store changes to default vector */
	address &= 0x7F;		//remote bit 7
	if(address >= SX_REG_BACKUP_OFFSET && (address - SX_REG_BACKUP_OFFSET) < sizeof(sx_reg_backup[SX_REG_BACKUP_LORA]))
		sx_reg_backup[SX_REG_BACKUP_LORA][address - SX_REG_BACKUP_OFFSET] = data;
#endif

}

void sx_writeRegister_nostore(uint8_t address, uint8_t data)
{
	sx_select();
	/* bit 7 set to write registers */
	address |= 0x80;

	uint8_t tx[2] = {address, data};
	HAL_SPI_Transmit(sx1272_spi, tx, 2, 200);
	sx_unselect();
}

uint8_t sx_readRegister_burst(uint8_t address, uint8_t *data, int length)
{
	if(sx1272_spi == NULL || data == NULL)
		return 0;

	sx_select();

	/* bit 7 cleared to read in registers */
	address &= 0x7F;

	HAL_SPI_Transmit(sx1272_spi, &address, 1, 200);
	HAL_StatusTypeDef ret = HAL_SPI_Receive(sx1272_spi, data, length, 200);
	sx_unselect();

	return (ret==HAL_OK)?length:0;
}

int sx_writeRegister_burst(uint8_t address, uint8_t *data, int length)
{
	if(sx1272_spi == NULL || data == NULL)
		return 0;

	sx_select();
	/* bit 7 set to write registers */
	address |= 0x80;

	HAL_SPI_Transmit(sx1272_spi, &address, 1, 200);
	HAL_StatusTypeDef ret = HAL_SPI_Transmit(sx1272_spi, data, length, 200);
	sx_unselect();

	return (ret==HAL_OK)?length:0;
}

bool sx_setOpMode(uint8_t mode)
{
	/* no mode change while tx */
	uint8_t opmode;
	uint16_t testLoops = 0;
	do
	{
		/* timeout */
		if(++testLoops > 5)
			HAL_Delay(1);
		if(testLoops > 300)
			return false;

		opmode = sx_readRegister(REG_OP_MODE);
	}while(SX_IN_X_TX_MODE(opmode) ||
			(SX_IN_RX_MODE(opmode) && (sx_readRegister(REG_MODEM_STAT) & 0x0B)));	//in tx mode or currently something receiving

	/* set mode */
	sx_writeRegister(REG_OP_MODE, mode);

	/* set rf analog end */
	switch (mode)
	{
	case LORA_RXSINGLE_MODE:
	case LORA_RXCONT_MODE:
	case LORA_CAD_MODE:
#ifdef SXTX_Pin
		HAL_GPIO_WritePin(SXTX_GPIO_Port, SXTX_Pin, GPIO_PIN_RESET);
#endif
#ifdef SXRX_Pin
		HAL_GPIO_WritePin(SXRX_GPIO_Port, SXRX_Pin, GPIO_PIN_SET);
#endif
	break;
	case LORA_TX_MODE:
	case GFSK_TX_MODE:
#ifdef SXRX_Pin
		HAL_GPIO_WritePin(SXRX_GPIO_Port, SXRX_Pin, GPIO_PIN_RESET);
#endif
#ifdef SXTX_Pin
		HAL_GPIO_WritePin(SXTX_GPIO_Port, SXTX_Pin, GPIO_PIN_SET);
#endif
	break;
	default:
#ifdef SXTX_Pin
		HAL_GPIO_WritePin(SXTX_GPIO_Port, SXTX_Pin, GPIO_PIN_RESET);
#endif
#ifdef SXRX_Pin
		HAL_GPIO_WritePin(SXRX_GPIO_Port, SXRX_Pin, GPIO_PIN_RESET);
#endif
		break;
	}

	/* wait for frequency synthesis, 70ms timeout */
	//note: LORA_CAD_MODE may instantaneously end in LORA_STANDBY_MODE
	opmode = 0;
	const uint8_t mask = (mode == LORA_CAD_MODE) ? 0xf9 : 0xff;
	for(int i=0; i<70 && opmode != (mode & mask); i++)
	{
		HAL_Delay(1);
		opmode = sx_readRegister(REG_OP_MODE) & mask;

		/* resend mode */
		if(i && i%20 == 0)
			sx_writeRegister(REG_OP_MODE, mode);
	}

#ifdef DEBUG
//	if((mode&mask) != opmode)
//		debug_printf("mode change failed. is%02X set%02X\n", opmode, mode);
#endif
	return (mode&mask) == opmode;
}

uint8_t sx_getOpMode(void)
{
	return sx_readRegister(REG_OP_MODE);
}

int sx_writeFifo(uint8_t addr, uint8_t *data, int length)
{
	/* select location */
	sx_writeRegister(REG_FIFO_ADDR_PTR, addr);

	/* write data */
	return sx_writeRegister_burst(REG_FIFO, data, length);
}

int sx_readFifo(uint8_t addr, uint8_t *data, int length)
{
	/* select location */
	sx_writeRegister(REG_FIFO_ADDR_PTR, addr);

	/* read data */
	return sx_readRegister_burst(REG_FIFO, data, length);
}

void sx_setDio0Irq(int mode)
{
	uint8_t map1 = sx_readRegister(REG_DIO_MAPPING1) & 0x3F;
	sx_writeRegister(REG_DIO_MAPPING1, map1 | mode);
}

float sx_expectedAirTime_ms(void)
{
#ifdef SX1272_DO_FSK
	uint8_t mode = sx_getOpMode();
	if(SX_IN_FSK_MODE(mode))
	{
		/* FSK */
		//note: fixed length, no address, ignoring CRC (as it's done in software here)
		int nbytes = ((sx_readRegister(REG_PREAMBLE_MSB_FSK) << 8) | sx_readRegister(REG_PREAMBLE_LSB_FSK)) +	//preamble
				(sx_readRegister(REG_SYNC_CONFIG)&SYNCSIZE_MASK_FSK) + 1 +				//syncword
				sx_readRegister(REG_PAYLOAD_LENGTH_FSK) * (sx_readRegister(REG_PACKET_CONFIG1)&0x20?2:1);//payload, assuming <256
		//int bitrate = (sx_readRegister(REG_BITRATE_MSB)<<8) | sx_readRegister(REG_BITRATE_LSB);
		int bitrate = (0x01<<8) | 0x40;			//note: hard coded
		if(bitrate <= 0)
			bitrate = 100;
		bitrate = 32e6 / bitrate;

		float air_time = (8.0f * nbytes) / bitrate * 1e3;
		return air_time;
	}
#endif
	/* LORA */
        float bw = 0.0f;
#ifdef SX1272_DO_FSK
        uint8_t cfg1 = sx_reg_backup[SX_REG_BACKUP_LORA][REG_MODEM_CONFIG1 - SX_REG_BACKUP_OFFSET];
#else
        uint8_t cfg1 = sx_readRegister(REG_MODEM_CONFIG1);
#endif
        uint8_t bw_reg = cfg1 & 0xC0;
        switch( bw_reg )
        {
        case 0:		// 125 kHz
            bw = 125000.0f;
            break;
        case 0x40: 	// 250 kHz
            bw = 250000.0f;
            break;
        case 0x80: 	// 500 kHz
            bw = 500000.0f;
            break;
        }

