3s1d/fanet-stm32/Src/fanet/radio/sx1272.c
        // Symbol rate : time for one symbol (secs)
#ifdef SX1272_DO_FSK
        uint8_t sf_reg = sx_reg_backup[SX_REG_BACKUP_LORA][REG_MODEM_CONFIG2 - SX_REG_BACKUP_OFFSET] >> 4;
#else
        uint8_t sf_reg = sx_readRegister(REG_MODEM_CONFIG2)>>4;
#endif
        //float sf = sf_reg<6 ? 6.0f : sf_reg;
        float rs = bw / ( 1 << sf_reg );
        float ts = 1 / rs;
#ifdef SX1272_DO_FSK
        /* time of preamble */
        //note: assuming preamble < 256
        float tPreamble = ( sx_reg_backup[SX_REG_BACKUP_LORA][REG_PREAMBLE_LSB_LORA - SX_REG_BACKUP_OFFSET] + 4.25f ) * ts;
#else
        // time of preamble
        float tPreamble = ( sx_readRegister(REG_PREAMBLE_LSB_LORA) + 4.25f ) * ts;		//note: assuming preamble < 256
#endif
        /* Symbol length of payload and time */
        //note: assuming CRC on -> 16, fixed length
        int pktlen = sx_readRegister(REG_PAYLOAD_LENGTH_LORA);

        int coderate = (cfg1 >> 3) & 0x7;
        float tmp = ceil( (8 * pktlen - 4 * sf_reg + 28 + 16 - 20) / (float)( 4 * ( sf_reg ) ) ) * ( coderate + 4 );
        float nPayload = 8 + ( ( tmp > 0 ) ? tmp : 0 );
        float tPayload = nPayload * ts;
        // Time on air
        float tOnAir = (tPreamble + tPayload) * 1000.0f;

        return tOnAir;
}

bool sx_receiveStart(void)
{
	if(sx_setOpMode(LORA_STANDBY_MODE) == false)
		return false;

	/* prepare receiving */
	sx_writeRegister(REG_FIFO_RX_BASE_ADDR, 0x00);
	sx_writeRegister(REG_PAYLOAD_LENGTH_LORA, 0xFF);		//is this evaluated in explicit mode?

	/* clear any rx done flag */
	sx_writeRegister(REG_IRQ_FLAGS, IRQ_RX_DONE);

	/* switch irq behavior to rx_done and enter rx cont mode */
	sx_setDio0Irq(DIO0_RX_DONE_LORA);
	return sx_setOpMode(LORA_RXCONT_MODE);
}

bool sx_toLoRa(void)
{
	/* FSK mode -> enter normal mode again */
	//note: we currently only support TX on FSK
	sx_setOpMode(GFSK_SLEEP_MODE);
	if(sx_setOpMode(LORA_SLEEP_MODE) == false)
		return false;

	/* drop all interrupts */
	sx_reg_backup[SX_REG_BACKUP_LORA][REG_IRQ_FLAGS - SX_REG_BACKUP_OFFSET] = 0xFF;

	if(sx_writeRegister_burst(SX_REG_BACKUP_OFFSET, sx_reg_backup[SX_REG_BACKUP_LORA], sizeof(sx_reg_backup[SX_REG_BACKUP_LORA])) <
			sizeof(sx_reg_backup[SX_REG_BACKUP_LORA]))
		sx_writeRegister_burst(SX_REG_BACKUP_OFFSET, sx_reg_backup[SX_REG_BACKUP_LORA], sizeof(sx_reg_backup[SX_REG_BACKUP_LORA]));

	/* switch irq behavior back and re-enter rx mode */
	if(sx1272_armed)
		return sx_receiveStart();
	return true;
}


int sx_channel_free4tx(bool doCAD)
{
	uint8_t mode = sx_getOpMode();
	if(SX_IN_FSK_MODE(mode))
		return TX_FSK_ONGOING;
	mode &= LORA_MODE_MASK;

	/* are we transmitting anyway? */
	if(mode == LORA_TX_MODE || mode == LORA_FSTX_MODE)
		return TX_TX_ONGOING;

	/* in case of receiving, is it ongoing? */
	for(uint16_t i=0; i<4 && (mode == LORA_RXCONT_MODE || mode == LORA_RXSINGLE_MODE); i++)
	{
		if(sx_readRegister(REG_MODEM_STAT) & 0x0B)
			return TX_RX_ONGOING;
		HAL_Delay(1);
	}

	/* CAD not required */
	if(doCAD == false)
		return TX_OK;

	/*
	 * CAD
	 */

	if(sx_setOpMode(LORA_STANDBY_MODE) == false)
		return TX_ERROR;
	sx_writeRegister(REG_IRQ_FLAGS, IRQ_CAD_DONE | IRQ_CAD_DETECTED);	/* clearing flags */
	sx_setOpMode(LORA_CAD_MODE);

	/* wait for CAD completion */
	uint8_t iflags;
	for(uint16_t i = 0; i<10 && ((iflags=sx_readRegister(REG_IRQ_FLAGS)) & IRQ_CAD_DONE) == 0; i++)
		HAL_Delay(1);

	if(iflags & IRQ_CAD_DETECTED)
	{
		/* re-establish old mode */
		if(mode == LORA_RXCONT_MODE || mode == LORA_RXSINGLE_MODE || mode == LORA_SLEEP_MODE)
			sx_setOpMode(mode);

		return TX_RX_ONGOING;
	}

	return TX_OK;
}

/*
 * public
 */

bool sx1272_init(SPI_HandleTypeDef *spi)
{
	sx1272_spi = spi;

	/* Pins */
	//note: are assumed to be configured
	sx_unselect();

	/* Configure SPI */
	//note: spi configured in spi.c

	/* Reset pulse for LoRa module initialization */
	HAL_GPIO_WritePin(SXRESET_GPIO_Port, SXRESET_Pin, GPIO_PIN_SET);
	HAL_Delay(1);
	HAL_GPIO_WritePin(SXRESET_GPIO_Port, SXRESET_Pin, GPIO_PIN_RESET);
	HAL_Delay(6);

	/* set Lora mode, this is only possible during sleep -> do it twice */
	sx_setOpMode(LORA_SLEEP_MODE);
	sx_setOpMode(LORA_SLEEP_MODE);

#ifdef SX1272_DO_FSK
	/* get POR registers */
	//note: required for FSK transition, storing is faster than performing a reset
	sx_readRegister_burst(SX_REG_BACKUP_OFFSET, sx_reg_backup[SX_REG_BACKUP_POR], sizeof(sx_reg_backup[SX_REG_BACKUP_POR]));
	sx_readRegister_burst(SX_REG_BACKUP_OFFSET, sx_reg_backup[SX_REG_BACKUP_LORA], sizeof(sx_reg_backup[SX_REG_BACKUP_LORA]));

	/* check data integrety */
	if(memcmp(sx_reg_backup[SX_REG_BACKUP_POR], sx_reg_backup[SX_REG_BACKUP_LORA], sizeof(sx_reg_backup[SX_REG_BACKUP_POR])) != 0)
	{
		HAL_Delay(2);
		sx_readRegister_burst(SX_REG_BACKUP_OFFSET, sx_reg_backup[SX_REG_BACKUP_POR], sizeof(sx_reg_backup[SX_REG_BACKUP_POR]));
		sx_readRegister_burst(SX_REG_BACKUP_OFFSET, sx_reg_backup[SX_REG_BACKUP_LORA], sizeof(sx_reg_backup[SX_REG_BACKUP_LORA]));
	}
#endif

	/* set standby mode */
	bool mode = sx_setOpMode(LORA_STANDBY_MODE);

	/* some more tweaks here */
	/* disable LowPnTxPllOff -> low phase noise PLL in transmit mode, however more current */
	sx_writeRegister(REG_PA_RAMP, 0x09);
	/* disable over current detection */
	sx_writeRegister(REG_OCP, 0x1B);

	return mode;
}

bool sx1272_setBandwidth(uint8_t bw)
{
	/* store state */
	uint8_t opmode = sx_getOpMode();

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE &&sx_setOpMode(LORA_STANDBY_MODE) == false)
		return false;

	uint8_t config1 = sx_readRegister(REG_MODEM_CONFIG1);
	config1 = (bw&BW_MASK) | (config1&(~BW_MASK));
	sx_writeRegister(REG_MODEM_CONFIG1, config1);

	/* adjust low data rate for high spread factor */
	if(bw == BW_125)
	{
		uint8_t sf = sx1272_getSpreadingFactor();
		if(sf == SF_11 || sf == SF_12)
			sx1272_setLowDataRateOptimize(true);
	}

	/* restore state */
	return opmode == LORA_STANDBY_MODE || sx_setOpMode(opmode);
}

uint8_t sx1272_getBandwidth(void)
{
	uint8_t bw = sx_readRegister(REG_MODEM_CONFIG1) & BW_MASK;

	return bw;
}

void sx1272_setLowDataRateOptimize(bool ldro)
{
	/* store state */
	uint8_t opmode = sx_getOpMode();

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(LORA_STANDBY_MODE);

