3s1d/fanet-stm32/Src/fanet/radio/sx1272.c
	uint8_t config1 = sx_readRegister(REG_MODEM_CONFIG1);
	config1 = (config1&0xFE) | !!ldro;
	sx_writeRegister(REG_MODEM_CONFIG1, config1);

	/* restore state */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(opmode);
}

bool sx1272_setPayloadCrc(bool crc)
{
	sx_payloadCrc = crc;

	/* store state */
	uint8_t opmode = sx_getOpMode();

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE && sx_setOpMode(LORA_STANDBY_MODE) == false)
		return false;

	uint8_t config1 = sx_readRegister(REG_MODEM_CONFIG1);
	config1 = (config1&0xFD) | (!!crc)<<1;
	sx_writeRegister(REG_MODEM_CONFIG1, config1);

	/* restore state */
	return opmode == LORA_STANDBY_MODE || sx_setOpMode(opmode);
}

bool sx1272_setSpreadingFactor(uint8_t spr)
{
	/* store state */
	uint8_t opmode = sx_getOpMode();

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE && sx_setOpMode(LORA_STANDBY_MODE) == false)
		return false;

	uint8_t config2 = sx_readRegister(REG_MODEM_CONFIG2);
	config2 = (spr&SF_MASK) | (config2&~SF_MASK);

	/* LowDataRateOptimize (Mandatory with SF_11 or SF_12 if BW_125) */
	if((spr == SF_11 || spr == SF_12) && sx1272_getBandwidth() == BW_125)
		sx1272_setLowDataRateOptimize(true);

	sx_writeRegister(REG_MODEM_CONFIG2, config2);

	/* Check if it is necessary to set special settings for SF=6 */
	if (spr == SF_6)
	{
		// Mandatory headerOFF with SF = 6 (Implicit mode)
		sx1272_setExplicitHeader(false);
		sx_writeRegister(REG_DETECT_OPTIMIZE, 0x05);
		sx_writeRegister(REG_DETECTION_THRESHOLD, 0x0C);
	}
	else
	{
		sx_writeRegister(REG_DETECT_OPTIMIZE, 0x03);
		sx_writeRegister(REG_DETECTION_THRESHOLD, 0x0A);
	}

	/* restore state */
	return opmode == LORA_STANDBY_MODE || sx_setOpMode(opmode);
}

uint8_t sx1272_getSpreadingFactor(void)
{
	uint8_t sf = sx_readRegister(REG_MODEM_CONFIG2) & SF_MASK;

	return sf;
}

bool sx1272_setCodingRate(uint8_t cr)
{
	/* store state */
	uint8_t opmode = sx_getOpMode();
	if(opmode == LORA_TX_MODE)
		return false;

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE && sx_setOpMode(LORA_STANDBY_MODE) == false)
		return false;

	uint8_t config1 = sx_readRegister(REG_MODEM_CONFIG1);
	config1 = (cr&CR_MASK) | (config1&~CR_MASK);
	sx_writeRegister(REG_MODEM_CONFIG1, config1);

	/* restore state */
	return opmode == LORA_STANDBY_MODE || sx_setOpMode(opmode);
}

uint8_t sx1272_getCodingRate(void)
{
	uint8_t cr = sx_readRegister(REG_MODEM_CONFIG1) & CR_MASK;

	return cr;
}

bool sx1272_setChannel(uint32_t ch)
{
	/* store state */
	uint8_t opmode = sx_getOpMode();

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE && sx_setOpMode(LORA_STANDBY_MODE) == false)
		return false;

	uint8_t freq3 = (ch >> 16) & 0x0FF;		// frequency channel MSB
	uint8_t freq2 = (ch >> 8) & 0xFF;		// frequency channel MID
	uint8_t freq1 = ch & 0xFF;			// frequency channel LSB

	sx_writeRegister(REG_FRF_MSB, freq3);
	sx_writeRegister(REG_FRF_MID, freq2);
	sx_writeRegister(REG_FRF_LSB, freq1);

	/* restore state */
	return opmode == LORA_STANDBY_MODE || sx_setOpMode(opmode);
}

uint32_t sx1272_getChannel(void)
{
	uint8_t freq3 = sx_readRegister(REG_FRF_MSB);	// frequency channel MSB
	uint8_t freq2 = sx_readRegister(REG_FRF_MID);	// frequency channel MID
	uint8_t freq1 = sx_readRegister(REG_FRF_LSB);	// frequency channel LSB
	uint32_t ch = ((uint32_t) freq3 << 16) + ((uint32_t) freq2 << 8) + (uint32_t) freq1;

	return ch;
}

bool sx1272_setExplicitHeader(bool exhdr)
{
	/* store state */
	uint8_t opmode = sx_getOpMode();

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE && sx_setOpMode(LORA_STANDBY_MODE) == false)
		return false;

	/* bit2: 0->explicit 1->implicit */
	uint8_t config1 = sx_readRegister(REG_MODEM_CONFIG1);
	config1 = (config1&0xFB) | (!exhdr)<<2;
	sx_writeRegister(REG_MODEM_CONFIG1, config1);

	/* restore state */
	return opmode == LORA_STANDBY_MODE || sx_setOpMode(opmode);
}

void sx1272_setLnaGain(uint8_t gain, bool lnaboost)
{
	/* store state */
	uint8_t opmode = sx_getOpMode();

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(LORA_STANDBY_MODE);

	sx_writeRegister(REG_LNA, (gain<<LNAGAIN_OFFSET) | (lnaboost?0x3:0x0));

	/* restore state */
	if(opmode != LORA_STANDBY_MODE)
		sx_setOpMode(opmode);
}

//note: we currently only support PA_BOOST
bool sx1272_setPower(int pwr)
{
	/* clamp pwr requirement */
	if(pwr < 2)
		pwr = 2;
	if(pwr > 20)
		pwr = 20;

	/* store state */
	uint8_t opmode = sx_getOpMode();

	/* set appropriate mode */
	if(opmode != LORA_STANDBY_MODE && sx_setOpMode(LORA_STANDBY_MODE) == false)
		return false;

	if(pwr >= 18)
	{
		/* high power mode */
		sx_writeRegister(REG_PA_DAC, PA_DAC_HIGH_PWR);
		pwr -= 5;
	}
	else
	{
		/* normal mode */
		sx_writeRegister(REG_PA_DAC, PA_DAC_DEFAULT_PWR);
		pwr -= 2;
	}

	/* PA output pin to PA_BOOST */
	sx_writeRegister(REG_PA_CONFIG, 0x80 | pwr);

	/* restore state */
	return opmode == LORA_STANDBY_MODE || sx_setOpMode(opmode);
}

bool sx1272_setArmed(bool mode)
{
	if(mode == sx1272_armed)
		return true;

	/* transmit packet in buffer */
	uint8_t opMode = sx_getOpMode();
	while(SX_IN_X_TX_MODE(opMode))
	{
		HAL_Delay(1);
		opMode = sx_getOpMode();
	}

	if(mode)
	{
		/* enable rx */
		sx1272_armed = sx_receiveStart();
		if(sx1272_armed == false)
			sx1272_armed = sx_receiveStart();
	}
	else
	{
		/* enter power save */
		sx1272_armed = !sx_setOpMode(LORA_SLEEP_MODE);
		if(sx1272_armed == true)
			sx1272_armed = !sx_setOpMode(LORA_SLEEP_MODE);

	}

	return sx1272_armed == mode;
}

bool sx1272_isArmed(void)
{
	return sx1272_armed;
}

bool sx1272_reset(bool hard)
{
	/* perform hardware reset */
	if(hard)
	{
		HAL_GPIO_WritePin(SXRESET_GPIO_Port, SXRESET_Pin, GPIO_PIN_SET);
		HAL_Delay(1);
		HAL_GPIO_WritePin(SXRESET_GPIO_Port, SXRESET_Pin, GPIO_PIN_RESET);
		HAL_Delay(7);
	}

	/* enter sleep mode soft way */
	sx_setOpMode(GFSK_SLEEP_MODE);
	sx_setOpMode(LORA_SLEEP_MODE);

	bool ret = sx_writeRegister_burst(REG_BITRATE_MSB, sx_reg_backup[SX_REG_BACKUP_LORA], sizeof(sx_reg_backup[SX_REG_BACKUP_LORA]));

	/* switch irq behavior back and re-enter rx mode */
	if(sx1272_armed && ret)
		ret &= sx_receiveStart();

	return ret;
}

//note: do not use hardware based interrupts here
void sx1272_irq(void)
{
#ifdef SX1272_DO_FSK
	uint8_t opMode = sx_getOpMode();
	if(SX_IN_FSK_MODE(opMode))
	{
		sx_toLoRa();
		return;
	}
#endif

	/* enter sleep mode */
	//note: does not destroy MSB (LORA <-> FSK)
	sx_setOpMode(LORA_STANDBY_MODE);

	if(sx1272_irq_cb == NULL)
	{
		sx_writeRegister(REG_IRQ_FLAGS, 0xFF);
		return;
	}

	uint8_t what = sx_readRegister(REG_IRQ_FLAGS);

