3s1d/fanet-stm32/Src/fanet/radio/sx1272.c
	/* Tx done */
	//if(what & IRQ_TX_DONE)
	//{
		//nothing to do...
	//}

	/* Rx done, CRC is valid and CRC was transmitted */
	if((what & IRQ_RX_DONE) && !(what & IRQ_PAYLOAD_CRC_ERROR) && (sx_readRegister(REG_HOP_CHANNEL) & CRC_ON_PAYLOAD))
	{
		/* retrieve data */
		const int received = sx_readRegister(REG_RX_NB_BYTES);

		/* callback function which is supposed to read the fifo */
		if(received > 0 && sx1272_irq_cb != NULL)
			sx1272_irq_cb(received);
	}

	/* clear all flag */
	sx_writeRegister(REG_IRQ_FLAGS, 0xFF);

	/* switch irq behavior back and re-enter rx mode */
	if(sx1272_armed)
		sx_receiveStart();
}


void sx1272_setIrqReceiver(irq_callback cb)
{
	sx_setOpMode(LORA_STANDBY_MODE);
	sx_setDio0Irq(DIO0_RX_DONE_LORA);

	/* clear all flag */
	sx_writeRegister(REG_IRQ_FLAGS, 0xFF);

	sx1272_irq_cb = cb;
	HAL_NVIC_EnableIRQ(SXDIO0_EXTI8_EXTI_IRQn);
}

void sx1272_clrIrqReceiver(void)
{
	sx_setOpMode(LORA_STANDBY_MODE);

	HAL_NVIC_DisableIRQ(SXDIO0_EXTI8_EXTI_IRQn);
	sx1272_irq_cb = NULL;
}

bool sx1272_setRegion(sx_region_t region)
{
	bool success = sx1272_setChannel(region.channel);
	if(success)
		success = sx1272_setPower(region.dBm);
	if(success)
		success = sx1272_setBandwidth(region.bw);

	if(success)
		sx1272_region = region;

	return success;
}

const sx_region_t *getRegion(void)
{
	return &sx1272_region;
}

void sx1272_setSyncWord(uint8_t sw)
{
	sx_writeRegister(REG_SYNCWORD_LORA, sw);
}

int sx1272_getRssi(void)
{
	/* get values */
	const int pktsnr = (int8_t) sx_readRegister(REG_PKT_SNR_VALUE);
	int rssi = -139 + sx_readRegister(REG_PKT_RSSI_VALUE);
	if(pktsnr < 0)
		rssi += ((pktsnr-2)/4);			//note: correct rounding for negative numbers

	return rssi;
}

/***********************************/
int sx1272_sendFrame(uint8_t *data, int length, uint8_t cr)
{
	/* channel accessible? */
	int state = sx_channel_free4tx(true);
	if(state != TX_OK)
		return state;

	/*
	 * Prepare TX
	 */
	sx_setOpMode(LORA_STANDBY_MODE);

	//todo: check fifo is empty, no rx data..

	/* adjust coding rate */
	//note: crc payload flag seems to get lost due to unknown issues!?!? resetting here just to be sure... fixme
	sx1272_setCodingRate(cr);
	sx1272_setPayloadCrc(sx_payloadCrc);

	/* upload frame */
	sx_writeFifo(0x00, data, length);
	sx_writeRegister(REG_FIFO_TX_BASE_ADDR, 0x00);
	sx_writeRegister(REG_PAYLOAD_LENGTH_LORA, length);

	/* prepare irq */
	if(sx1272_irq_cb)
	{
		/* clear flag */
		sx_writeRegister(REG_IRQ_FLAGS, IRQ_TX_DONE);
		sx_setDio0Irq(DIO0_TX_DONE_LORA);
	}

	/* update air time */
	sx_airtime += sx_expectedAirTime_ms();

	/* tx */
	sx_setOpMode(LORA_TX_MODE);

	/* ensure we enter tx mode before leaving */
	HAL_Delay(2);

	/* bypass waiting */
	if(sx1272_irq_cb)
		return TX_OK;

	for(int i=0; i<100 && sx_getOpMode() == LORA_TX_MODE; i++)
		HAL_Delay(5);

	return TX_OK;
}

int sx1272_receiveFrame(uint8_t *data, int max_length)
{
	sx_setOpMode(LORA_STANDBY_MODE);

	/* prepare receiving */
	sx_writeRegister(REG_FIFO_RX_BASE_ADDR, 0x00);
	sx_writeRegister(REG_PAYLOAD_LENGTH_LORA, max_length);
	//writeRegister(REG_SYMB_TIMEOUT_LSB, 0xFF);	//test max payload

	sx_setOpMode(LORA_RXCONT_MODE);

	/* wait for rx or timeout */
	for(int i=0; i<400 && !(sx_readRegister(REG_IRQ_FLAGS) & 0x40); i++)
		HAL_Delay(5);

	/* stop rx mode and retrieve data */
	sx_setOpMode(LORA_STANDBY_MODE);
	const int received = sx_readRegister(REG_RX_NB_BYTES);
	const int rxstartaddr = sx_readRegister(REG_RX_NB_BYTES);
	sx_readFifo(rxstartaddr, data, min(received, max_length));

	/* clear the rxDone flag */
	sx_writeRegister(REG_IRQ_FLAGS, IRQ_RX_DONE);

	return received;
}

int sx1272_getFrame(uint8_t *data, int max_length)
{
	const int received = sx_readRegister(REG_RX_NB_BYTES);
	const int rxstartaddr = sx_readRegister(REG_FIFO_RX_CURRENT_ADDR);
	sx_readFifo(rxstartaddr, data, min(received, max_length));

	return min(received, max_length);
}

float sx1272_get_airlimit(void)
{
	static uint32_t last = 0;
	uint32_t current = HAL_GetTick();
	uint32_t dt = current - last;
	last = current;

	/* reduce airtime by 1% */
	sx_airtime -= dt*0.01f;
	if(sx_airtime < 0.0f)
		sx_airtime = 0.0f;

	/* air time over 3min average -> 1800ms air time allowed in 1% terms */
	return sx_airtime / 1800.0f;
}

#ifdef SX1272_DO_FSK

/*
 *
 * FSK extension
 *
 */

//note: this method is highly optimized to switch between GFSK and LORA
int sx1272_sendFrame_FSK(sx_fsk_conf_t *conf, uint8_t *data, int num_data)
{
	if(conf == NULL || conf->num_syncword<=0)
		return TX_ERROR;

	/* channel accessible? */
	int state = sx_channel_free4tx(false);
	if(state != TX_OK)
		return state;

	/*
	 * Store register content, switch to FSK, and prepare TX
	 */
	if(sx_setOpMode(LORA_SLEEP_MODE) == false)
		return TX_ERROR;
	sx_writeRegister_burst(SX_REG_BACKUP_OFFSET, sx_reg_backup[SX_REG_BACKUP_POR], sizeof(sx_reg_backup[SX_REG_BACKUP_POR]));
	sx_setOpMode(GFSK_SLEEP_MODE);

	/* bitrate 100kbps -> 320 */
	sx_writeRegister_nostore(REG_BITRATE_MSB, 0x01);
	sx_writeRegister_nostore(REG_BITRATE_LSB, 0x40);

	/* freq */
	int frf = round(((double)conf->frep) * 1638.4116);			//correct value: 1638.4 (don't use float)
	sx_writeRegister_nostore(REG_FRF_MSB, (frf>>16) & 0xFF);
	sx_writeRegister_nostore(REG_FRF_MID, (frf>>8) & 0xFF);
	sx_writeRegister_nostore(REG_FRF_LSB, frf & 0xFF);

	/* fdev 50khz -> 819.2(0x333), 100kHz -> 1638.4(0x666) */
	sx_writeRegister_nostore(REG_FDEV_MSB, 0x03);
	sx_writeRegister_nostore(REG_FDEV_LSB, 0x33);

	/* PA output pin to PA_BOOST, power to default value */
	int pwr_dBm = sx1272_region.dBm;
	if(pwr_dBm >= 18)
	{
		/* high power mode */
		sx_writeRegister_nostore(REG_PA_DAC, PA_DAC_HIGH_PWR);
		pwr_dBm -= 5;
	}
	else
	{
		/* normal mode */
		sx_writeRegister_nostore(REG_PA_DAC, PA_DAC_DEFAULT_PWR);
		pwr_dBm -= 2;
	}
	sx_writeRegister_nostore(REG_PA_CONFIG, 0x80 |  max(0, pwr_dBm));

	/* disable LowPnTxPllOff -> low phase noise PLL in transmit mode, however more current */
	sx_writeRegister_nostore(REG_PA_RAMP, 0x09);
	/* disable over current detection */
	sx_writeRegister_nostore(REG_OCP, 0x1B);

	/* set num_syncword, preamble polarity to 0x55 */
	sx_writeRegister_nostore(REG_SYNC_CONFIG, PREMBLEPOLARITY_FSK | SYNCON_FSK | ((conf->num_syncword-1) & SYNCSIZE_MASK_FSK));

	/* set syncword */
	sx_writeRegister_burst(REG_SYNC_VALUE1, conf->syncword, min(8,conf->num_syncword));

	/* manchester coding, no CRC */
	sx_writeRegister_nostore(REG_PACKET_CONFIG1, 0x20);

	/* packet mode */
	sx_writeRegister_nostore(REG_PACKET_CONFIG2, 0x40);

	/* upload data */
	sx_writeRegister_nostore(REG_PAYLOAD_LENGTH_FSK, num_data&0xFF);	//we silently assume max 64bytes as data due to hardware fifo limits
	sx_writeRegister_burst(REG_FIFO, data, num_data);

	/* prepare irq */
	if(sx1272_irq_cb)
		sx_setDio0Irq(DIO0_PACKET_SENT_FSK);
	else
		sx_setDio0Irq(DIO0_NONE_FSK);

	/* update air time */
	sx_airtime += sx_expectedAirTime_ms();

	/* start TX */
	//note: seq: tx on start, from transmit -> lowpower, lowpower = seq_off (w/ init mode), start
#ifdef SXRX_Pin
		HAL_GPIO_WritePin(SXRX_GPIO_Port, SXRX_Pin, GPIO_PIN_RESET);
#endif
#ifdef SXTX_Pin
		HAL_GPIO_WritePin(SXTX_GPIO_Port, SXTX_Pin, GPIO_PIN_SET);
#endif
	sx_writeRegister_nostore(REG_SEQ_CONFIG1, 0x80 | 0x10);

	/* ensure we enter tx mode before leaving */
	//note: transition to GFSK_TX_MODE is not immediately!
	HAL_Delay(2);

	/* bypass waiting */
	if(sx1272_irq_cb)
		return TX_OK;

	/* wait for completion */
	HAL_Delay(2);
	for(int i=0; i<100 && (sx_getOpMode()&0x07) == 0x03; i++)
		HAL_Delay(2);

	/* reestablish state */
	sx_setOpMode(GFSK_SLEEP_MODE);
	sx_setOpMode(LORA_SLEEP_MODE);
	sx_writeRegister_burst(SX_REG_BACKUP_OFFSET, sx_reg_backup[SX_REG_BACKUP_LORA], sizeof(sx_reg_backup[SX_REG_BACKUP_LORA]));

	return TX_OK;
}

#endif
